app/views/recipes/_form.html.erb

SELECT "styles".* FROM "styles"
---
    <strong>Styles</strong>
    <%= f.collection_check_boxes :styles_ids, Style.all, :id, :name do |cb| %>

SELECT "ingredients".* FROM "ingredients"
---
    <strong>Ingredients</strong>
    <%= f.collection_check_boxes :ingredient_ids, Ingredient.all, :id, :name do |cbi| %>