app/controllers/chefs_controller.rb

 def index
   @chefs = Chef.paginate(page: params[:page]), per_page: 6
---
SELECT  "chefs".* FROM "chefs" LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "chefs"

  def create
    @chef = Chef.new(chef_params)
    if @chef.save
---
INSERT INTO "chefs" ("chefname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
   @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 2]]

  def update
    if @chef.update(chef_params)
---
UPDATE "chefs" SET "password_digest" = ?, "updated_at" = ? WHERE "chefs"."id" = ?  [["password_digest", "$2a$10$1GwOiBvslpvcG4eVBm5Yqex518JFfqM2BtBXDUcZuO1hK0nVmnlLG"], ["updated_at", "2017-10-17 19:03:24.894913"], ["id", 2]]

 def show
   @recipes = @chef.recipes.paginate(page: params[:page], per_page: 6)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = ? LIMIT 6 OFFSET 0  [["chef_id", 1]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 1]]

  def set_chef
      @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 2]]