app/controllers/ingredients_controller.rb

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 3]]
SELECT "ingredients".* FROM "ingredients"
SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]
SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]
---
 def show
  @ingredient = Ingredient.find(params[:id])
  @recipes = @ingredient.recipes.paginate(page: params[:page],per_page: 4)

INSERT INTO "ingredients" ("name") VALUES (?)  [["name", "new ingredient1"]]
---
 def create
   @ingredient = Ingredient.new(ing.params)
   if @ingredient.save