app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.paginate(page: params[:page], per_page: 4)
---
SELECT  "recipes".* FROM "recipes" LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "recipes"

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.chef = current_user

    if @recipe.save
---
INSERT INTO "recipes" ("name", "summary", "description", "picture", "chef_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = ?, "summary" = ?, "description" = ?, "picture" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", "Fish of the day"], ["summary", "still kikking"], ["description", "Haaa!!! very good for your belly"], ["picture", "fishes.jpg"], ["updated_at", "2017-10-17 21:35:12.283869"], ["id", 4]]

  def like
    like = Like.create(like: params[:like], chef: current_user, recipe: @recipe)
---
INSERT INTO "likes" ("like", "chef_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["like", "t"], ["chef_id", 1], ["recipe_id", 1], ["created_at", "2017-10-16 14:26:41.157931"], ["updated_at", "2017-10-16 14:26:41.157931"]]