app/controllers/styles_controller.rb

SELECT  "styles".* FROM "styles" WHERE "styles"."id" = ? LIMIT 1  [["id", 1]]
SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_styles" ON "recipes"."id" = "recipe_styles"."recipe_id" WHERE "recipe_styles"."style_id" = ?  [["style_id", 1]]
SELECT "styles".* FROM "styles"
SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_styles" ON "recipes"."id" = "recipe_styles"."recipe_id" WHERE "recipe_styles"."style_id" = ?  [["style_id", 1]]
---
 def show
   @style = Style.find(params[:id])
   @recipes = @style.recipes.paginate(page: params[:page], per_page: 4)

INSERT INTO "styles" ("name") VALUES (?)  [["name", "American style"]]
---
  def create
    @style = Style.new(style_params)
    if @style.save