app/views/layouts/_navigation.html.erb

       <ul class='dropdown-menu'>
         <% Style.all.each do |style| %>
---
SELECT "styles".* FROM "styles"

         <ul class='dropdown-menu'>
           <% Ingredient.all.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients"